tweeter_app_api/app/controllers/tweets_controller.rb

    def index
        tweets = Tweet.all
---
SELECT "tweets".* FROM "tweets"

    def show
        found_tweet = Tweet.find(params[:id])
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        tweet = Tweet.new(tweet_params)
    if tweet.save
---
INSERT INTO "tweets" ("title", "content", "author") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Why Armenians rock "], ["content", "We rock because our rice pilaf is awesome. "], ["author", "Andrew Kazanjian "]]

    def destroy
        tweet = Tweet.destroy(params[:id])
---
DELETE FROM "tweets" WHERE "tweets"."id" = $1  [["id", 3]]

    def update
        tweet = Tweet.find(params[:id])
        tweet.update(tweet_params)
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "tweets" SET "title" = $1 WHERE "tweets"."id" = $2  [["title", "Why Armenians Restaurants rock"], ["id", 3]]